<?php

use App\FineType;
use Illuminate\Database\Seeder;

class FineTypesTableSeeder extends Seeder
{
    public function run()
    {

        $fineTypes = [
        	[
                'reference' => '380-R/2014',
        		'description' => 'ކާބޯތަކެތީގެ ޚިދުމަތްދޭ ތަންތަނުގެ ތެރެއިން ދަރަޖަ ކުރެވޭ ތަނަކަށް ދެވިފައިވާ ދަރަޖަ ކާޑު ފެންނަގޮތަށް ހަރުކުރެވިފައި ނެތުމުން ކުރެވޭ ޖޫރިމަނާ',
        		'amount' => 1000,
        	],
            [
                'reference' => '380-R/2014',
                'description' => 'ކާބޯތަކެތީގެ ޚިދުމަތްދޭ ތަނެއް ބަންދުކުރުމަށްފަހު އެތަނުގައި ބެހެއްޓޭ "ބަންދު ނޯޓިސް" އެތަނަކަށް އަލުން ހުއްދަ ނުލިބެނީސް ނެގުން ނުވަތަ ހަލާކު ކުރުން ނުވަތަ އާންމުންނަށް ނުފެންނަގޮތަށް ނިވާކޮއްފައި ބެހެއްޓުން',
                'amount' => 5000,
            ],
            [
                'reference' => '380-R/2014',
                'description' => 'ތަނެއް އިސްލާހުކުރަނޖެހޭ މުއްދަތުގައި ގަވާއިދާއި ޚިލާފުވި ކަމެއް ރަގަޅު ނުކުރުން',
                'amount' => 5000,
            ],
            [
                'reference' => '380-R/2014',
                'description' => 'ކާބޯތަކެތީގެ ޚިދުމަތްދޭ ތަންތަން ބަލާ ފާސްކުރުމަށް ހެލްތު ޕްރޮޓެކްޝަން އެޖެންސީއިން ނުވަތަ އެ އެޖެންސީއިން ކަ ނޑައަޅާ ފަރާތަކުން ދިޔުމުން، އެ ފަރާތަކުން މަސައްކަތަށް ހުރަސް އެޅުން',
                'amount' => 5000,
            ],
            [
                'reference' => '380-R/2014',
                'description' => 'ކާބޯތަކެތީގެ ޚިދުމަތް ދިނުމުގެ ހުއްދައިގެ މުއްދަތު ހަމަވުމަށްފަހު، ހުއްދަ އާނުކޮށް ހިންގުން އަދި ހުއްދަ އާނުކޮށް ހިންގި މުއްދަތަށް ބަލާ ކުރެވޭ ޖޫރިމަނާ (ފާއިތުވާ ކޮންމެ ދުވަހަކަށް -/100ރ)',
                'amount' => 5000,
            ],
            [
                'reference' => '380-R/2014',
                'description' => 'ހެލްތު ޕްރޮޓެކްޝަން އޭޖެންސީން ނުވަތަ އޭޖެންސީން ކަ ނޑައަޅާ ފަރާތަކުން ކާބޯތަކެތި ތައްޔާރުކޮށް އުފައްދާ ވިއްކާތަނެއް ބަންދު ކުރުމަށް ފަހު އަލުން ހުއްދަ ނުދެނީސް ހިންގުން',
                'amount' => 5000,
            ],
            [
                'reference' => '380-R/2014',
                'description' => 'ހެލްތު ޕްރޮޓެކްޝަން އެޖެންސީ އިން ލިސްޓްކޮށްފައިވާ (މެޑިކަލް އެގްޒާމިނޭޝަން ފޯރ ފުޑް ހޭންޑްލާރސް) ބައްޔެއް ހުރި ނުވަތަ ބައްޔެއް ފަތުރާ ވަސީލަތަކަށް ހުށައެޅިފައިވާ މީހަކު ކާބޯތަކެތީގެ ޚިދުމަތްދޭ އެއްވެސް ތަނެއްގައި ވަޒީފާގައި ގެންގުޅޭކަން ސާބިތުވެއްޖެނަމަ ކުރެވޭ ޖޫރިމަނާ',
                'amount' => 5000,
            ],
            [
                'reference' => '380-R/2014',
                'description' => 'މީހަކު ކުރާ ކަމެއްގެ ސަބަބުން، ނުވަތަ ކެމިކަލެއް ވާސިލުވެގެން، ނުވަތަ އެނޫންވެސް ގޮތަކުން އެތާނގައި ތައްޔާރުކުރެވޭ ކާނާ ނަޖިސްވެދާނެ ނުވަތަ ނުތާހިރުވެދާނެ އެއްވެސް ކަމެއް، ކާބޯތަކެތީގެ ޚިދުމަތްދޭ ތަނެއްގައި ދިމާވެއްޖެ ނަމަ ކުރެވޭ ޖޫރިމަނާ',
                'amount' => 5000,
            ],
            [
                'reference' => '380-R/2014',
                'description' => 'ކުނިވެފައިވާ ކާނާއާއި ދުވަސް ހަމަވެފައިވާ ކާނާއާއި ރަހަ ނުބައިވެފައިވާ ކާނާއާއި ވިހަވެފައިވާ ކާނާއާއި ގަޑުބަޑުކޮށްފައިވާ ކާނާ އެއްވެސް ފަރާތަކުން ވިއްކައިފިނަމަ ކުރެވޭ ޖޫރިމަނާ',
                'amount' => 5000,
            ],
            [
                'reference' => '380-R/2014',
                'description' => 'ގަޞްދުގައި މީހަކު ކުރާ ކަމެއްގެ ސަބަބުން ތަނެއްގައި ތައްޔާރުކުރެވޭ ކާނާ ވިހަވެފައި، ނުވަތަ ނަޖިސްވެފައި، ނުވަތަ ނުތާހިރުވެފައި، ނުވަތަ ގަޑުބަޑުވެފައި، ހުއްޓާ އެފަދަ އެއްވެސް އެއްޗެއް އެއްވެސް މީހަކަށް ދީގެން ނުވަތަ ވިއްކައިފިނަމަ ކުރެވޭ ޖޫރިމަނާ',
                'amount' => 5000,
            ],
            [
                'reference' => '380-R/2014',
                'description' => 'ޚިދުމަތް ލިބިގަންނަ ފަރާތަށް ޚިދުމަތުގެ ނުވަތަ ކާބޯތަކެތީގެ ފެންވަރު އޮޅުވާލުމުގެ ނިޔަތުގައި ޤަޞްދުގައި ކުރާ ޢަމަލެއް ކޮށްފިނަމަ ކުރެވޭ ޖޫރިމަނާ',
                'amount' => 5000,
            ],
            [
                'reference' => '15/2010',
                'description' => 'ދުންފަތުގެ އިސްތިއުމާލު ކުރުން މަނާ ތަނެއްގައި ދުންފަތުގެ އިސްތިޢުމާލު ކުރީތީ ގަވާއިދުގެ 9(ހ)ގެ ދަށުން ކުރެވޭ ޖޫރިމަނާ',
                'amount' => 500,
            ],
            [
                'reference' => '15/2010',
                'description' => 'ދުންފަތުގެ އިސްތިއުމާލު ކުރުން މަނާ، އާންމުތަންތަން ފިޔަވާ އެހެން ތަނެއްގައި ދުންފަތުގެ އިސްތިއުމާލު ކުރަމުން ދާތީ، ޤަވާއިދުގެ 9(ށ) ގެ ދަށުން އެތަނެއްގެ ވެރިފަރާތް ކުރެވޭ ޖޫރިމަނާ އަދަދު',
                'amount' => 1000,
            ],
            [
                'reference' => '15/2010',
                'description' => 'ދުންފަތުގެ އިސްތިއުމާލު ކުރުން މާނާ ތަނެއްކަން އަންގައި ދޭ ލިޔުން ބަހައްޓާފައި ނުވާތީ ގަވާއިދު 9(ނ)ގެ ދަށުން އެތަނެއްގެ ވެރިފަރާތް ފުރަތަމަ ފަހަރު ކުރެވޭ ޖޫރިމަނާ:',
                'amount' => 500,
            ],
            [
                'reference' => '15/2010',
                'description' => 'ދުންފަތުގެ އިސްތިއުމާލުކުރުން މަނާތަނެއްކަން އަންގައިދޭ ލިޔުން ބަހައްޓާފައި ނުވާތީ އަދި މިކަން ތަކުރާރު ވެފައިވާތީ ގަވާއިދުގެ 9(ނ) ގެ ދަށުން އެތަނެއްގެ ވެރިފަރާތް ކުރެވޭ ޖޫރިމަނާ:',
                'amount' => 5000,
            ],
        ];

        $fineTypeModel = new FineType;
        foreach ($fineTypes as $fineType) {
        	$fineTypeModel->create($fineType);
        }
    }
}
